// json是以陣列＋物件組成
// 範例網址：https://data.kcg.gov.tw/dataset/kcgoa-00000118-bf6
var data = [{"seq":1,"車站編號":"C1","車站中文名稱":"籬仔內站","車站英文名稱":"Lizihnei","x(TWD67座標)":"179740.43314400","y(TWD67座標)":"2500872.44551700"},{"seq":2,"車站編號":"C2","車站中文名稱":"凱旋瑞田站","車站英文名稱":"Kaisyuan Rueitian","x(TWD67座標)":"179234.05083300","y(TWD67座標)":"2500304.73698800"},{"seq":3,"車站編號":"C3","車站中文名稱":"前鎮之星站","車站英文名稱":"Cianjhen Star","x(TWD67座標)":"178779.26759000","y(TWD67座標)":"2499860.52175500"},{"seq":4,"車站編號":"C4","車站中文名稱":"凱旋中華站","車站英文名稱":"Kaisyuan Jhonghua","x(TWD67座標)":"178279.47286100","y(TWD67座標)":"2499658.28400800"},{"seq":5,"車站編號":"C5","車站中文名稱":"夢時代站","車站英文名稱":"Dream Mall","x(TWD67座標)":"177713.44548600","y(TWD67座標)":"2499797.09354300"},{"seq":6,"車站編號":"C6","車站中文名稱":"經貿園區站","車站英文名稱":"Commerce and Trade Park","x(TWD67座標)":"177475.52066700","y(TWD67座標)":"2500470.93500600"},{"seq":7,"車站編號":"C7","車站中文名稱":"軟體園區站","車站英文名稱":"Software Technology Park","x(TWD67座標)":"177290.01735600","y(TWD67座標)":"2500994.91853900"},{"seq":8,"車站編號":"C8","車站中文名稱":"高雄展覽館站","車站英文名稱":"Kaohsiung Exhibition Center","x(TWD67座標)":"177003.47483000","y(TWD67座標)":"2501488.94958300"},{"seq":9,"車站編號":"C9","車站中文名稱":"旅運中心站","車站英文名稱":"Cruise Terminal","x(TWD67座標)":"176532.99434000","y(TWD67座標)":"2501656.38853300"},{"seq":10,"車站編號":"C10","車站中文名稱":"光榮碼頭站","車站英文名稱":"Glory Pier","x(TWD67座標)":"176511.84902100","y(TWD67座標)":"2502224.32274100"},{"seq":11,"車站編號":"C11","車站中文名稱":"真愛碼頭站","車站英文名稱":"Love Pier","x(TWD67座標)":"176128.61976500","y(TWD67座標)":"2502509.89235800"},{"seq":12,"車站編號":"C12","車站中文名稱":"駁二大義站","車站英文名稱":"Dayi Pier-2","x(TWD67座標)":"175586.95237700","y(TWD67座標)":"2502429.18298600"},{"seq":13,"車站編號":"C13","車站中文名稱":"駁二蓬萊站","車站英文名稱":"Penglai Pier-2","x(TWD67座標)":"175149.19735800","y(TWD67座標)":"2502645.25320500"},{"seq":14,"車站編號":"C14","車站中文名稱":"哈瑪星站","車站英文名稱":"Hamasen","x(TWD67座標)":"174730.04000200","y(TWD67座標)":"2502771.53689900"}];

// 撈出 夢時代站 的車站編號與車站英文名稱
var dataTotal = data.length;
var dataShow = document.querySelector('.dataShow');
for(var i=0;i < dataTotal;i++){
    if(data[i].車站中文名稱 == '夢時代站'){
        dataShow.textContent='車站編號:'+ data[i].車站編號 + ';車站英文名稱:'+ data[i].車站英文名稱;
    }
}
